junbin-yang/hex4-truth/esp32s3_hex4_guard/project/sdkconfig.defaults
# HEX4-Truth 通用安全监控器工程默认配置
CONFIG_IDF_TARGET="esp32s3"

# M1.3 值守集成: 使能 ULP-RISC-V (hex4_ulp 组件)
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_RISCV=y
# RTC SLOW 预留 4KB (ULP 固件 ~2KB + mailbox; 上限 8176B 会挤占
# 主 CPU 的 .rtc.force_slow 段导致链接溢出 12B)
CONFIG_ULP_COPROC_RESERVE_MEM=4096

# 日志等级调低, 输出干净
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2

# 控制台日志走直连 USB 口 (USB-Serial-JTAG), 释放 UART0:
# UART0 (GPIO43/44, 经板载 CH343 到 USB-UART 口) 用作指令链路 (开发调试形态)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
